Revit 2027 API
ReinforcementRoundingManager.GetLengthUnitTypeId Method
 Gets the identifier of the length unit quantifying the reinforcement rounding values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetLengthUnitTypeId()
Public Function GetLengthUnitTypeId As ForgeTypeId
public:
ForgeTypeId^ GetLengthUnitTypeId()
member GetLengthUnitTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace